config/cf/Catalogs/КанбанДоски.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>КанбанДоски</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Изображение</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипФона</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипФонаКанбанДоски</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветФона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Группы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Группа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ГруппыКанбанДоски</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛимитЗадач</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИспользоватьЛимитЗадач</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сортировка</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СортировкаКанбанДоски</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

config/cf/Enums/СортировкаКанбанДоски.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>СортировкаКанбанДоски</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Авто</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоВыполнениюСрочностиИДате</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоВыполнениюСрочностиИДатеПоУбыванию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоДатеВыполненияПоВозрастанию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоДатеВыполненияПоУбыванию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоДатеПоВозрастанию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоДатеПоследнегоИзменения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоДатеПоследнегоИзмененияПоУбыванию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоДатеПоУбыванию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоИнициаторуИДате</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоИнициаторуИДатеПоУбыванию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоИсполнителюИДате</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоИсполнителюИДатеПоУбыванию</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

config/cf/Catalogs/КанбанДоски/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Заполняет предопределенные этапы процессов.
//
// Параметры:
//	Нет.
//
Процедура ЗаполнитьКанбанДоскиПриПервоначальномЗаполнении() Экспорт
	
	ГД = Справочники.ГруппыКанбанДоски;
	
	НачатьТранзакцию();
	
	Попытка
		
		Объект = Справочники.КанбанДоски.ГлавнаяДоска.ПолучитьОбъект();
		Объект.Наименование = НСтр("ru = 'Главная доска'");
		Объект.Группы.Очистить();
		
		НоваяСтрока 						= Объект.Группы.Добавить();
		НоваяСтрока.Группа 					= ГД.Новые;
		НоваяСтрока.ИспользоватьЛимитЗадач 	= Истина;
		НоваяСтрока.ЛимитЗадач 				= 50;
		НоваяСтрока.Сортировка				= Перечисления.СортировкаКанбанДоски.ПоВыполнениюСрочностиИДате;
		
		НоваяСтрока 						= Объект.Группы.Добавить();
		НоваяСтрока.Группа 					= ГД.Backlog;
		НоваяСтрока.ИспользоватьЛимитЗадач 	= Ложь;
		НоваяСтрока.ЛимитЗадач 				= 50;
		НоваяСтрока.Сортировка				= Перечисления.СортировкаКанбанДоски.Авто;
		
		НоваяСтрока 						= Объект.Группы.Добавить();
		НоваяСтрока.Группа 					= ГД.ВРаботе;
		НоваяСтрока.ИспользоватьЛимитЗадач 	= Ложь;
		НоваяСтрока.ЛимитЗадач 				= 50;
		НоваяСтрока.Сортировка				= Перечисления.СортировкаКанбанДоски.ПоВыполнениюСрочностиИДате;
		
		НоваяСтрока 						= Объект.Группы.Добавить();
		НоваяСтрока.Группа 					= ГД.Выполненные;
		НоваяСтрока.ИспользоватьЛимитЗадач 	= Истина;
		НоваяСтрока.ЛимитЗадач 				= 50;
		НоваяСтрока.Сортировка				= Перечисления.СортировкаКанбанДоски.ПоДатеПоследнегоИзмененияПоУбыванию;
		
		Объект.Записать();
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
